Tekla Open API Reference for Tekla Structures 2025
DetailMark.DetailMarkAttributes.BoundaryLineColor Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.BoundaryLineColor"]
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute]
public DrawingColors BoundaryLineColor { get; set; }
<ObsoleteAttribute>
Public Property BoundaryLineColor As DrawingColors
	Get
	Set
Property Value
Type: DrawingColors
See Also
Reference
DetailMark.DetailMarkAttributes Class
Tekla.Structures.Drawing Namespace